{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 331], "name": "input_6", "sparse": false}, "inbound_nodes": [], "name": "input_6"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_266", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "dense_266"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_201"}, "inbound_nodes": [[["dense_266", 0, 0, {}]]], "name": "dropout_201"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_201"}, "inbound_nodes": [[["dropout_201", 0, 0, {}]]], "name": "leaky_re_lu_201"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_81", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_201", 0, 0, {}]]], "name": "lambda_81"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_82", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_201", 0, 0, {}]]], "name": "lambda_82"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_83", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_201", 0, 0, {}]]], "name": "lambda_83"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_84", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_201", 0, 0, {}]]], "name": "lambda_84"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_267", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_81", 0, 0, {}]]], "name": "dense_267"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_270", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_82", 0, 0, {}]]], "name": "dense_270"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_273", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_83", 0, 0, {}]]], "name": "dense_273"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_276", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_84", 0, 0, {}]]], "name": "dense_276"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_202"}, "inbound_nodes": [[["dense_267", 0, 0, {}]]], "name": "dropout_202"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_204"}, "inbound_nodes": [[["dense_270", 0, 0, {}]]], "name": "dropout_204"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_206"}, "inbound_nodes": [[["dense_273", 0, 0, {}]]], "name": "dropout_206"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_208"}, "inbound_nodes": [[["dense_276", 0, 0, {}]]], "name": "dropout_208"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_202"}, "inbound_nodes": [[["dropout_202", 0, 0, {}]]], "name": "leaky_re_lu_202"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_204"}, "inbound_nodes": [[["dropout_204", 0, 0, {}]]], "name": "leaky_re_lu_204"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_206"}, "inbound_nodes": [[["dropout_206", 0, 0, {}]]], "name": "leaky_re_lu_206"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_208"}, "inbound_nodes": [[["dropout_208", 0, 0, {}]]], "name": "leaky_re_lu_208"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_268", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_202", 0, 0, {}]]], "name": "dense_268"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_271", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_204", 0, 0, {}]]], "name": "dense_271"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_274", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_206", 0, 0, {}]]], "name": "dense_274"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_277", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_208", 0, 0, {}]]], "name": "dense_277"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_203"}, "inbound_nodes": [[["dense_268", 0, 0, {}]]], "name": "dropout_203"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_205"}, "inbound_nodes": [[["dense_271", 0, 0, {}]]], "name": "dropout_205"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_207"}, "inbound_nodes": [[["dense_274", 0, 0, {}]]], "name": "dropout_207"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_209"}, "inbound_nodes": [[["dense_277", 0, 0, {}]]], "name": "dropout_209"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_203"}, "inbound_nodes": [[["dropout_203", 0, 0, {}]]], "name": "leaky_re_lu_203"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_205"}, "inbound_nodes": [[["dropout_205", 0, 0, {}]]], "name": "leaky_re_lu_205"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_207"}, "inbound_nodes": [[["dropout_207", 0, 0, {}]]], "name": "leaky_re_lu_207"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_209"}, "inbound_nodes": [[["dropout_209", 0, 0, {}]]], "name": "leaky_re_lu_209"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_269", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_203", 0, 0, {}]]], "name": "dense_269"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_272", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_205", 0, 0, {}]]], "name": "dense_272"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_275", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_207", 0, 0, {}]]], "name": "dense_275"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_278", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_209", 0, 0, {}]]], "name": "dense_278"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_41"}, "inbound_nodes": [[["dense_269", 0, 0, {}], ["dense_272", 0, 0, {}], ["dense_275", 0, 0, {}], ["dense_278", 0, 0, {}]]], "name": "add_41"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_210"}, "inbound_nodes": [[["add_41", 0, 0, {}]]], "name": "dropout_210"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_210"}, "inbound_nodes": [[["dropout_210", 0, 0, {}]]], "name": "leaky_re_lu_210"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_42"}, "inbound_nodes": [[["leaky_re_lu_201", 0, 0, {}], ["leaky_re_lu_210", 0, 0, {}]]], "name": "add_42"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_279", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["add_42", 0, 0, {}]]], "name": "dense_279"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_211"}, "inbound_nodes": [[["dense_279", 0, 0, {}]]], "name": "dropout_211"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_211"}, "inbound_nodes": [[["dropout_211", 0, 0, {}]]], "name": "leaky_re_lu_211"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_85", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_211", 0, 0, {}]]], "name": "lambda_85"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_86", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_211", 0, 0, {}]]], "name": "lambda_86"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_87", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_211", 0, 0, {}]]], "name": "lambda_87"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_88", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_211", 0, 0, {}]]], "name": "lambda_88"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_280", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_85", 0, 0, {}]]], "name": "dense_280"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_283", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_86", 0, 0, {}]]], "name": "dense_283"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_286", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_87", 0, 0, {}]]], "name": "dense_286"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_289", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_88", 0, 0, {}]]], "name": "dense_289"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_212"}, "inbound_nodes": [[["dense_280", 0, 0, {}]]], "name": "dropout_212"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_214"}, "inbound_nodes": [[["dense_283", 0, 0, {}]]], "name": "dropout_214"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_216"}, "inbound_nodes": [[["dense_286", 0, 0, {}]]], "name": "dropout_216"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_218"}, "inbound_nodes": [[["dense_289", 0, 0, {}]]], "name": "dropout_218"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_212"}, "inbound_nodes": [[["dropout_212", 0, 0, {}]]], "name": "leaky_re_lu_212"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_214"}, "inbound_nodes": [[["dropout_214", 0, 0, {}]]], "name": "leaky_re_lu_214"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_216"}, "inbound_nodes": [[["dropout_216", 0, 0, {}]]], "name": "leaky_re_lu_216"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_218"}, "inbound_nodes": [[["dropout_218", 0, 0, {}]]], "name": "leaky_re_lu_218"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_281", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_212", 0, 0, {}]]], "name": "dense_281"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_284", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_214", 0, 0, {}]]], "name": "dense_284"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_287", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_216", 0, 0, {}]]], "name": "dense_287"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_290", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_218", 0, 0, {}]]], "name": "dense_290"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_213"}, "inbound_nodes": [[["dense_281", 0, 0, {}]]], "name": "dropout_213"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_215"}, "inbound_nodes": [[["dense_284", 0, 0, {}]]], "name": "dropout_215"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_217"}, "inbound_nodes": [[["dense_287", 0, 0, {}]]], "name": "dropout_217"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_219"}, "inbound_nodes": [[["dense_290", 0, 0, {}]]], "name": "dropout_219"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_213"}, "inbound_nodes": [[["dropout_213", 0, 0, {}]]], "name": "leaky_re_lu_213"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_215"}, "inbound_nodes": [[["dropout_215", 0, 0, {}]]], "name": "leaky_re_lu_215"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_217"}, "inbound_nodes": [[["dropout_217", 0, 0, {}]]], "name": "leaky_re_lu_217"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_219"}, "inbound_nodes": [[["dropout_219", 0, 0, {}]]], "name": "leaky_re_lu_219"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_282", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_213", 0, 0, {}]]], "name": "dense_282"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_285", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_215", 0, 0, {}]]], "name": "dense_285"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_288", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_217", 0, 0, {}]]], "name": "dense_288"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_291", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_219", 0, 0, {}]]], "name": "dense_291"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_43"}, "inbound_nodes": [[["dense_282", 0, 0, {}], ["dense_285", 0, 0, {}], ["dense_288", 0, 0, {}], ["dense_291", 0, 0, {}]]], "name": "add_43"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_220"}, "inbound_nodes": [[["add_43", 0, 0, {}]]], "name": "dropout_220"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_220"}, "inbound_nodes": [[["dropout_220", 0, 0, {}]]], "name": "leaky_re_lu_220"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_44"}, "inbound_nodes": [[["leaky_re_lu_211", 0, 0, {}], ["leaky_re_lu_220", 0, 0, {}]]], "name": "add_44"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_292", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["add_44", 0, 0, {}]]], "name": "dense_292"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_221"}, "inbound_nodes": [[["dense_292", 0, 0, {}]]], "name": "dropout_221"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_221"}, "inbound_nodes": [[["dropout_221", 0, 0, {}]]], "name": "leaky_re_lu_221"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_89", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_221", 0, 0, {}]]], "name": "lambda_89"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_90", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_221", 0, 0, {}]]], "name": "lambda_90"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_91", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_221", 0, 0, {}]]], "name": "lambda_91"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_92", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_221", 0, 0, {}]]], "name": "lambda_92"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_293", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_89", 0, 0, {}]]], "name": "dense_293"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_296", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_90", 0, 0, {}]]], "name": "dense_296"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_299", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_91", 0, 0, {}]]], "name": "dense_299"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_302", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_92", 0, 0, {}]]], "name": "dense_302"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_222"}, "inbound_nodes": [[["dense_293", 0, 0, {}]]], "name": "dropout_222"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_224"}, "inbound_nodes": [[["dense_296", 0, 0, {}]]], "name": "dropout_224"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_226"}, "inbound_nodes": [[["dense_299", 0, 0, {}]]], "name": "dropout_226"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_228"}, "inbound_nodes": [[["dense_302", 0, 0, {}]]], "name": "dropout_228"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_222"}, "inbound_nodes": [[["dropout_222", 0, 0, {}]]], "name": "leaky_re_lu_222"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_224"}, "inbound_nodes": [[["dropout_224", 0, 0, {}]]], "name": "leaky_re_lu_224"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_226"}, "inbound_nodes": [[["dropout_226", 0, 0, {}]]], "name": "leaky_re_lu_226"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_228"}, "inbound_nodes": [[["dropout_228", 0, 0, {}]]], "name": "leaky_re_lu_228"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_294", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_222", 0, 0, {}]]], "name": "dense_294"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_297", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_224", 0, 0, {}]]], "name": "dense_297"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_300", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_226", 0, 0, {}]]], "name": "dense_300"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_303", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_228", 0, 0, {}]]], "name": "dense_303"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_223"}, "inbound_nodes": [[["dense_294", 0, 0, {}]]], "name": "dropout_223"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_225"}, "inbound_nodes": [[["dense_297", 0, 0, {}]]], "name": "dropout_225"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_227"}, "inbound_nodes": [[["dense_300", 0, 0, {}]]], "name": "dropout_227"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_229"}, "inbound_nodes": [[["dense_303", 0, 0, {}]]], "name": "dropout_229"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_223"}, "inbound_nodes": [[["dropout_223", 0, 0, {}]]], "name": "leaky_re_lu_223"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_225"}, "inbound_nodes": [[["dropout_225", 0, 0, {}]]], "name": "leaky_re_lu_225"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_227"}, "inbound_nodes": [[["dropout_227", 0, 0, {}]]], "name": "leaky_re_lu_227"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_229"}, "inbound_nodes": [[["dropout_229", 0, 0, {}]]], "name": "leaky_re_lu_229"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_295", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_223", 0, 0, {}]]], "name": "dense_295"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_298", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_225", 0, 0, {}]]], "name": "dense_298"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_301", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_227", 0, 0, {}]]], "name": "dense_301"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_304", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_229", 0, 0, {}]]], "name": "dense_304"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_45"}, "inbound_nodes": [[["dense_295", 0, 0, {}], ["dense_298", 0, 0, {}], ["dense_301", 0, 0, {}], ["dense_304", 0, 0, {}]]], "name": "add_45"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_230"}, "inbound_nodes": [[["add_45", 0, 0, {}]]], "name": "dropout_230"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_230"}, "inbound_nodes": [[["dropout_230", 0, 0, {}]]], "name": "leaky_re_lu_230"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_46"}, "inbound_nodes": [[["leaky_re_lu_221", 0, 0, {}], ["leaky_re_lu_230", 0, 0, {}]]], "name": "add_46"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_305", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["add_46", 0, 0, {}]]], "name": "dense_305"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_231"}, "inbound_nodes": [[["dense_305", 0, 0, {}]]], "name": "dropout_231"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_231"}, "inbound_nodes": [[["dropout_231", 0, 0, {}]]], "name": "leaky_re_lu_231"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_93", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_231", 0, 0, {}]]], "name": "lambda_93"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_94", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_231", 0, 0, {}]]], "name": "lambda_94"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_95", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_231", 0, 0, {}]]], "name": "lambda_95"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABgAAAEMAAABzLgAAAHwAAGQAAGQAAIUCAHQAAHQBAHQCABkUdAAAZAEAF3QBAHQC\nABkUhQIAZgIAGVMoAgAAAE5pAQAAACgDAAAAdAEAAABpdAIAAABkY3QBAAAAaigBAAAAdAEAAAB6\nKAAAAAAoAAAAAHMIAAAAbGVhcm4ucHl0CAAAADxsYW1iZGE+3AAAAHMAAAAA\n", null, null], "name": "lambda_96", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["leaky_re_lu_231", 0, 0, {}]]], "name": "lambda_96"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_306", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_93", 0, 0, {}]]], "name": "dense_306"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_309", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_94", 0, 0, {}]]], "name": "dense_309"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_312", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_95", 0, 0, {}]]], "name": "dense_312"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_315", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["lambda_96", 0, 0, {}]]], "name": "dense_315"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_232"}, "inbound_nodes": [[["dense_306", 0, 0, {}]]], "name": "dropout_232"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_234"}, "inbound_nodes": [[["dense_309", 0, 0, {}]]], "name": "dropout_234"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_236"}, "inbound_nodes": [[["dense_312", 0, 0, {}]]], "name": "dropout_236"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_238"}, "inbound_nodes": [[["dense_315", 0, 0, {}]]], "name": "dropout_238"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_232"}, "inbound_nodes": [[["dropout_232", 0, 0, {}]]], "name": "leaky_re_lu_232"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_234"}, "inbound_nodes": [[["dropout_234", 0, 0, {}]]], "name": "leaky_re_lu_234"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_236"}, "inbound_nodes": [[["dropout_236", 0, 0, {}]]], "name": "leaky_re_lu_236"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_238"}, "inbound_nodes": [[["dropout_238", 0, 0, {}]]], "name": "leaky_re_lu_238"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_307", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_232", 0, 0, {}]]], "name": "dense_307"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_310", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_234", 0, 0, {}]]], "name": "dense_310"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_313", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_236", 0, 0, {}]]], "name": "dense_313"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_316", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_238", 0, 0, {}]]], "name": "dense_316"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_233"}, "inbound_nodes": [[["dense_307", 0, 0, {}]]], "name": "dropout_233"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_235"}, "inbound_nodes": [[["dense_310", 0, 0, {}]]], "name": "dropout_235"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_237"}, "inbound_nodes": [[["dense_313", 0, 0, {}]]], "name": "dropout_237"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_239"}, "inbound_nodes": [[["dense_316", 0, 0, {}]]], "name": "dropout_239"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": "leaky_re_lu_233"}, "inbound_nodes": [[["dropout_233", 0, 0, {}]]], "name": "leaky_re_lu_233"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.30000001192092896, "trainable": true, "name": 