{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 331], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 331], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 331], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Dense", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Features1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 426, "use_bias": true, "activity_regularizer": null}, "name": "Features1"}, {"class_name": "Dropout", "inbound_nodes": [[["Features1", 0, 0, {}]]], "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Features2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 284, "use_bias": true, "activity_regularizer": null}, "name": "Features2"}, {"class_name": "Dropout", "inbound_nodes": [[["Features2", 0, 0, {}]]], "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Features3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "name": "Features3"}, {"class_name": "Dropout", "inbound_nodes": [[["Features3", 0, 0, {}]]], "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_3"}, "name": "dropout_3"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dropout_3", 0, 0]]}, "inbound_nodes": [[["input_2", 0, 0, {}]], [["input_3", 0, 0, {}]]], "name": "model_1"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAABAAAABAAAAFMAAABzGQAAAHQAAGoBAHwAAGQBABl8AABkAgAZGIMBAFMoAwAAAE5pAAAA\nAGkBAAAAKAIAAAB0AQAAAEt0AwAAAGFicygBAAAAdAcAAAB0ZW5zb3JzKAAAAAAoAAAAAHM/AAAA\nL2hvbWUvbG5haXIzL05pbWJ1c193cy9zcmMvbmltYnVzX2V4cGxvcmUvc3JjL3BpZXJjZV9wcmVk\naWN0LnB5dAgAAAA8bGFtYmRhPnQAAABzAAAAAA==\n", null, null], "name": "L1_Distance", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["model_1", 1, 0, {}], ["model_1", 2, 0, {}]]], "name": "L1_Distance"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "Final_Layer", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["L1_Distance", 0, 0, {}]]], "name": "Final_Layer"}], "input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["Final_Layer", 0, 0]], "name": "model_2"}, "backend": "tensorflow"}